text = 'Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .'

word1 = input('Введите слово')

word2 = input('Введите букву')

word3 = input('Введите слово')

word4 = input('Введите букву')

word5 = input('Введите слово')

word6 = input('Введите слово')

word7 = input('Введите букву')

print(f'Шляпка гриба, покрытая {word1} кожиц{word2}й, держится на {word3} ножк{word4} . Снизу шляпка затянута {word5} плёнкой. Когда её уберёшь, откроется нижняя {word6} сторона шляпк{word7} .')